Tekla.Structures.Model.RebarPropertyModifier
The RebarPropertyModifier class represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
The following example shows how to create and add a RebarPropertyModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarPropertyModifier
var strip = new RebarPropertyModifier();
strip.Father = rebarSet;
strip.GroupingType = RebarPropertyModifier.GroupingTypeEnum.AUTOMATIC;
strip.RebarProperties.Name = "REBAR";
strip.RebarProperties.Class = 3;
strip.RebarProperties.Grade = "H";
strip.RebarProperties.Size = "12";
strip.RebarProperties.BendingRadius = 24;
strip.RebarProperties.NumberingSeries.StartNumber = 1;
// Override the rebar set spacings in the region of the property modifier
strip.SpacingOverride = RebarSpacing.Create(
RebarSpacing.SpacingType.EXACT_FLEXIBLE_LAST,
new RebarSpacing.Offset(true, 0.0),
new RebarSpacing.Offset(true, 0.0),
100.0);
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 200, 0), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 1000, 0), null));
strip.Insert();
}
}

Tekla.Structures.Model.RebarPropertyModifier.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarPropertyModifier class.

Tekla.Structures.Model.RebarPropertyModifier.AffectsWholeBarPlane
Gets or sets a value indicating whether the modifier affects all bars in the plane or just those that it touches.

Tekla.Structures.Model.RebarPropertyModifier.RebarProperties
Gets or sets the reinforcing bar properties.

Tekla.Structures.Model.RebarPropertyModifier.GroupingType
Gets or sets the grouping type.

Tekla.Structures.Model.RebarPropertyModifier.SpacingOverride
Gets or sets the spacing override.

Tekla.Structures.Model.RebarPropertyModifier.FatherPart
Gets or sets the father part for all bars touching the property modifier.

Tekla.Structures.Model.RebarPropertyModifier.GetAffectedBars
Gets the virtual bars affected by this modifier.
Returns: A Tekla.Structures.Model.ModelObjectEnumerator containing the virtual rebars of the rebar set that are affected.

Tekla.Structures.Model.RebarPropertyModifier.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarPropertyModifier.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarPropertyModifier.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarPropertyModifier.ToStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t})
The to struct.
dotStrip: The dot strip.
dotSpacingElementList: The dot spacing elements.

Tekla.Structures.Model.RebarPropertyModifier.AddFlags(System.Int32@)
Append to the given flags the appropriate value for non null fields.
flags: The flags.

Tekla.Structures.Model.RebarPropertyModifier.FromStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingElement_t})
The from struct.
dotStrip: The dot strip.
dotSpacingElementList: The dot spacing elements.

Tekla.Structures.Model.RebarPropertyModifier.SetNullProperties(System.Int32)
Set fields to null where the corresponding flag isn't set.
flags: The flags.